bench/results/don.txt
Bombarding http://127.0.0.1:8080/hello with 100000 request(s) using 100 connection(s)
 100000 / 100000  100.00% 166144/s 0s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    203008.25   35810.71  290527.54
  Latency      492.83us   274.41us    20.72ms
  Latency Distribution
     50%   499.00us
     75%   832.00us
     90%     1.10ms
     95%     1.18ms
     99%     1.69ms
  HTTP codes:
    1xx - 0, 2xx - 100000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    37.18MB/s