bench/results/gorestful.txt
Bombarding http://127.0.0.1:8080/hello with 100000 request(s) using 100 connection(s)
 100000 / 100000  100.00% 83046/s 1s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     87343.86   12761.18  121047.70
  Latency        1.14ms   368.81us    27.99ms
  Latency Distribution
     50%     0.92ms
     75%     1.47ms
     90%     2.67ms
     95%     3.74ms
     99%     5.45ms
  HTTP codes:
    1xx - 0, 2xx - 100000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    16.19MB/s